/*
题目描述  
张景中院士给青少年出过一道趣题。这道题来自阿拉伯传统故事，有个老父亲，有17头羊，临终前把三个儿子叫来。分给大儿子一半的羊，二儿子1/3的羊，小儿子1/9的羊。
三个儿子不知道怎么分，只好请叫邻居。聪明的邻居借给了他们一头羊，这样总共就有18头。大儿子领走一半9头羊，二儿子领走1/3共6头羊，小儿子领走1/9，也就是2头羊。邻居最后把借的羊牵回去了。
我们的问题是，满足这样条件的数字还有哪些？即遗产有n头羊，大儿子分得1/x, 二儿子分得1/y, 小儿子分得1/z，邻居借给一头羊。请编程找出这些满足条件的(n, x, y, z)。
*/
#include<stdio.h>
int main()
{
    int n,x,y,z,counter;
    for(x = 1;x < 100;x++){
        for(y = 1;y < 100;y++){
            for(z = 1; z < 100;z++){
                for(n = 1;n < 100;n++){
                    if(((n+1)*(y*z + x*z + x*y) == n*x*y*z) && (n == x + y + z)){
                        printf("n=%d,x=%d,y=%d,z=%d\n",n,x,y,z);
                        counter++;
                    }
                }
            }
        }
    }

    printf("满足条件的(n, x, y, z)为%d\n",counter);

    return 0;
}
